Revit 2024 API
City.Latitude Property
Latitude of the city
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Latitude { get; }
Visual Basic
Public ReadOnly Property Latitude As Double
	Get
Visual C++
public:
property double Latitude {
	double get ();
}
Remarks
A read only property that contains the latitude of the city. The value returned is in radians, ranging from -PI to +PI.
See Also
City Class
Autodesk.Revit.DB Namespace